In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("E:\\restate.csv")
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [6]:
df1=df.copy()

In [7]:
df1.head(3)

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00

In [8]:
df2=df1.copy()

In [9]:
loc=df2.groupby('location')['location'].agg('count').sort_values(ascending=False)

In [10]:
loc

location
Whitefield                              540
Sarjapur  Road                          399
Electronic City                         302
Kanakpura Road                          273
Thanisandra                             234
                                       ...
Kodanda Reddy Layout                      1
Kirloskar layout, Basaveshwarnagar        1
Kengeri Satellite Town Stage II           1
Kengeri Satellite Town KHB Apartment      1
 Anekal                                   1
Name: location, Length: 1305, dtype: int64

In [11]:
loc20=loc[loc<=20]
loc20

location
Poorna Pragna Layout                    20
Sanjay nagar                            20
Yelachenahalli                          20
HBR Layout                              20
HRBR Layout                             19
                                        ..
Kodanda Reddy Layout                     1
Kirloskar layout, Basaveshwarnagar       1
Kengeri Satellite Town Stage II          1
Kengeri Satellite Town KHB Apartment     1
 Anekal                                  1
Name: location, Length: 1161, dtype: int64

In [12]:
df2['location']=df2['location'].apply(lambda x: 'other' if x in loc20 else x)

In [13]:
df2.head(10)

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1                     other  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00
5                Whitefield      2 BHK       1170   2.0   38.00
6          Old Airport Road      4 BHK       2732   4.0  204.00
7              Rajaji Nagar      4 BHK       3300   4.0  600.00
8              Marathahalli      3 BHK       1310   3.0   63.25
9                     other  6 Bedroom       1020   6.0  370.00

In [14]:
df3=df2.copy()

In [15]:
df3['bhk']=df3['size'].str.replace('[A-Za-z]','')

In [16]:
df3.head()

                   location       size total_sqft  bath   price bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07  2
1                     other  4 Bedroom       2600   5.0  120.00  4
2               Uttarahalli      3 BHK       1440   2.0   62.00  3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00  3
4                  Kothanur      2 BHK       1200   2.0   51.00  2

In [17]:
df3.drop(['size'],axis=1,inplace=True)

In [18]:
def float_bhk(x):
    return float(x)

In [19]:
df3['bhk']=df3['bhk'].apply(float_bhk)

In [20]:
df3.head(3)

                   location total_sqft  bath   price  bhk
0  Electronic City Phase II       1056   2.0   39.07  2.0
1                     other       2600   5.0  120.00  4.0
2               Uttarahalli       1440   2.0   62.00  3.0

In [21]:
df4=df3.copy()

In [22]:
df4['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [23]:
def float_sqft(x):
    try:
        float(x)
    except:
        return False
    return True

In [24]:
df4[~df4['total_sqft'].apply(float_sqft)]

                 location   total_sqft  bath    price  bhk
30              Yelahanka  2100 - 2850   4.0  186.000  4.0
56            Devanahalli  3010 - 3410   NaN  192.000  4.0
81            Hennur Road  2957 - 3450   NaN  224.500  4.0
122                Hebbal  3067 - 8156   4.0  477.000  4.0
137    8th Phase JP Nagar  1042 - 1105   2.0   54.005  2.0
...                   ...          ...   ...      ...  ...
12990      Talaghattapura  1804 - 2273   3.0  122.000  3.0
13059              Harlur  1200 - 1470   2.0   72.760  2.0
13240         Devanahalli  1020 - 1130   NaN   52.570  1.0
13265               Hoodi  1133 - 1384   2.0   59.135  2.0
13299          Whitefield  2830 - 2882   5.0  154.500  4.0

[247 rows x 5 columns]

In [29]:
def avg_sqft(x):
    tokens= x. split('-')
    if len(tokens)==2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [30]:
df4['total_sqft']=df4['total_sqft'].apply(avg_sqft)

In [31]:
df4.head()

                   location  total_sqft  bath   price  bhk
0  Electronic City Phase II      1056.0   2.0   39.07  2.0
1                     other      2600.0   5.0  120.00  4.0
2               Uttarahalli      1440.0   2.0   62.00  3.0
3        Lingadheeranahalli      1521.0   3.0   95.00  3.0
4                  Kothanur      1200.0   2.0   51.00  2.0

In [32]:
df4.isnull().sum()

location       1
total_sqft    46
bath          73
price          0
bhk           16
dtype: int64

In [33]:
df4.dropna(inplace=True)

In [34]:
df4.isnull().sum()

location      0
total_sqft    0
bath          0
price         0
bhk           0
dtype: int64

In [35]:
df4.shape

(13200, 5)

In [36]:
df5=df4.copy()

In [37]:
df5.shape

(13200, 5)

In [38]:
bath=df5.groupby('bath')['bath'].agg('count').sort_values()

In [39]:
bath

bath
40.0       1
18.0       1
15.0       1
14.0       1
27.0       1
16.0       2
13.0       3
11.0       3
12.0       7
10.0      13
9.0       41
8.0       64
7.0      102
6.0      269
5.0      521
1.0      781
4.0     1222
3.0     3274
2.0     6893
Name: bath, dtype: int64

In [40]:
df6=df5[df5['bath']<=9]

In [41]:
df6.head()

                   location  total_sqft  bath   price  bhk
0  Electronic City Phase II      1056.0   2.0   39.07  2.0
1                     other      2600.0   5.0  120.00  4.0
2               Uttarahalli      1440.0   2.0   62.00  3.0
3        Lingadheeranahalli      1521.0   3.0   95.00  3.0
4                  Kothanur      1200.0   2.0   51.00  2.0

In [42]:
bath2=df6.groupby('bath')['bath'].agg('count').sort_values(ascending=False)

In [43]:
bath2

bath
2.0    6893
3.0    3274
4.0    1222
1.0     781
5.0     521
6.0     269
7.0     102
8.0      64
9.0      41
Name: bath, dtype: int64

In [44]:
df6.isnull().sum()

location      0
total_sqft    0
bath          0
price         0
bhk           0
dtype: int64

In [45]:
df6['pps']=df6['price']*100000/df6['total_sqft']
df6.head(3)

C:\Users\pc\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

                   location  total_sqft  bath   price  bhk          pps
0  Electronic City Phase II      1056.0   2.0   39.07  2.0  3699.810606
1                     other      2600.0   5.0  120.00  4.0  4615.384615
2               Uttarahalli      1440.0   2.0   62.00  3.0  4305.555556

In [53]:
df7=df6[df6['pps']>=1500]

In [47]:
df7.isnull().sum()

location      0
total_sqft    0
bath          0
price         0
bhk           0
pps           0
dtype: int64

In [54]:
df7.shape

(13150, 6)

In [55]:
df7['bhkarea']=df7['total_sqft']/df7['bhk']

C:\Users\pc\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [56]:
df7.head()

,location,total_sqft,bath,price,bhk,pps,bhkarea
0,Electronic City Phase II,1056.0,2.0,39.07,2.0,3699.810606,528.0
1,other,2600.0,5.0,120.00,4.0,4615.384615,650.0
2,Uttarahalli,1440.0,2.0,62.00,3.0,4305.555556,480.0
3,Lingadheeranahalli,1521.0,3.0,95.00,3.0,6245.890861,507.0
4,Kothanur,1200.0,2.0,51.00,2.0,4250.000000,600.0

In [57]:
df8=df7[df7['bhkarea']>=450]

In [58]:
df8.shape

(10604, 7)

In [59]:
df8.isnull().sum()

location      0
total_sqft    0
bath          0
price         0
bhk           0
pps           0
bhkarea       0
dtype: int64

In [60]:
bedroom=df8.groupby('bhk')['bhk'].agg('count').sort_values(ascending=False)
bedroom

bhk
2.0     5069
3.0     3746
4.0      975
1.0      575
5.0      155
6.0       46
7.0       19
8.0       10
9.0        8
11.0       1
Name: bhk, dtype: int64

In [65]:
br=df8.loc[df8['bhk']>=6]

In [66]:
br

,location,total_sqft,bath,price,bhk,pps,bhkarea
79,other,4400.0,6.0,250.0,6.0,5681.818182,733.333333
85,Hegde Nagar,3000.0,7.0,210.0,6.0,7000.000000,500.000000
140,Hennur Road,5000.0,8.0,250.0,8.0,5000.000000,625.000000
145,other,4000.0,7.0,225.0,7.0,5625.000000,571.428571
216,Magadi Road,3600.0,6.0,141.0,6.0,3916.666667,600.000000
...,...,...,...,...,...,...,...
12987,other,30400.0,4.0,1824.0,6.0,6000.000000,5066.666667
13141,other,4600.0,9.0,150.0,9.0,3260.869565,511.111111
13187,other,4000.0,7.0,110.0,8.0,2750.000000,500.000000
13200,other,8000.0,6.0,2800.0,6.0,35000.000000,1333.333333
13226,Raja Rajeshwari Nagar,6000.0,8.0,215.0,8.0,3583.333333,750.000000

In [67]:
df9=df8[df8['bhkarea']<=1500]

In [68]:
df9.shape

(10531, 7)

In [69]:
df10=df9[df9['pps']<=10000]

In [70]:
df10.shape

(9672, 7)

In [71]:
df10.isnull().sum()

location      0
total_sqft    0
bath          0
price         0
bhk           0
pps           0
bhkarea       0
dtype: int64

In [72]:
df10.head()

,location,total_sqft,bath,price,bhk,pps,bhkarea
0,Electronic City Phase II,1056.0,2.0,39.07,2.0,3699.810606,528.0
1,other,2600.0,5.0,120.00,4.0,4615.384615,650.0
2,Uttarahalli,1440.0,2.0,62.00,3.0,4305.555556,480.0
3,Lingadheeranahalli,1521.0,3.0,95.00,3.0,6245.890861,507.0
4,Kothanur,1200.0,2.0,51.00,2.0,4250.000000,600.0

In [73]:
def price_outlier(df):
    df_new=pd.DataFrame()
    for key,sdf in df.groupby('location'):
        m=sdf['pps'].mean()
        s=sdf['pps'].std()
        rdf=sdf[(sdf['pps'] <= m+s) & (sdf['pps'] >= m-s)]
        df_new=pd.concat([df_new,rdf],ignore_index=True)
    return df_new

In [76]:
df11=price_outlier(df10)

In [77]:
df11.shape

(6862, 7)

In [79]:
loc_dummy=pd.get_dummies(df11['location'],drop_first=True)
loc_dummy

,2nd Stage Nagarbhavi,5th Phase JP Nagar,6th Phase JP Nagar,7th Phase JP Nagar,8th Phase JP Nagar,9th Phase JP Nagar,Abbigere,Akshaya Nagar,Ambalipura,Ambedkar Nagar,...,Uttarahalli,Varthur,Vidyaranyapura,Vijayanagar,Vittasandra,Whitefield,Yelahanka,Yelahanka New Town,Yeshwanthpur,other
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6857,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
6858,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
6859,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
6860,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
6861,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1

In [80]:
df11=df11.join(loc_dummy)
df11.head()

,location,total_sqft,bath,price,bhk,pps,bhkarea,2nd Stage Nagarbhavi,5th Phase JP Nagar,6th Phase JP Nagar,...,Uttarahalli,Varthur,Vidyaranyapura,Vijayanagar,Vittasandra,Whitefield,Yelahanka,Yelahanka New Town,Yeshwanthpur,other
0,1st Phase JP Nagar,2825.0,4.0,250.0,4.0,8849.557522,706.250000,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1st Phase JP Nagar,1875.0,3.0,167.0,3.0,8906.666667,625.000000,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1st Phase JP Nagar,2024.0,3.0,157.0,3.0,7756.916996,674.666667,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1st Phase JP Nagar,1394.0,2.0,100.0,2.0,7173.601148,697.000000,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1st Phase JP Nagar,1077.0,2.0,93.0,2.0,8635.097493,538.500000,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [81]:
df11.drop(['location','pps','bhkarea'],axis=1,inplace=True)

In [82]:
df11.head()

,total_sqft,bath,price,bhk,2nd Stage Nagarbhavi,5th Phase JP Nagar,6th Phase JP Nagar,7th Phase JP Nagar,8th Phase JP Nagar,9th Phase JP Nagar,...,Uttarahalli,Varthur,Vidyaranyapura,Vijayanagar,Vittasandra,Whitefield,Yelahanka,Yelahanka New Town,Yeshwanthpur,other
0,2825.0,4.0,250.0,4.0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1875.0,3.0,167.0,3.0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,2024.0,3.0,157.0,3.0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1394.0,2.0,100.0,2.0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1077.0,2.0,93.0,2.0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [83]:
df11.isnull().sum()

total_sqft              0
bath                    0
price                   0
bhk                     0
2nd Stage Nagarbhavi    0
                       ..
Whitefield              0
Yelahanka               0
Yelahanka New Town      0
Yeshwanthpur            0
other                   0
Length: 146, dtype: int64

In [84]:
df11.shape

(6862, 146)

In [85]:
X=df11.drop(['price'],axis=1)

In [86]:
y=df11['price']

In [87]:
y

0       250.00
1       167.00
2       157.00
3       100.00
4        93.00
         ...
6857     65.00
6858    103.00
6859     63.93
6860     60.00
6861     48.00
Name: price, Length: 6862, dtype: float64

In [88]:
X.shape

(6862, 145)

In [89]:
from sklearn.model_selection import train_test_split

In [90]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [91]:
from sklearn.linear_model import LinearRegression

In [92]:
lreg=LinearRegression()

In [93]:
lreg.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [94]:
lreg.score(X_test,y_test)

0.9198785043705803

In [95]:
lreg.predict(X_test)

array([ 69.29926138,  87.38192258,  66.88629412, ...,  71.89001003,
       121.74655947, 125.7229009 ])

In [97]:
import numpy as np

In [98]:
def predict_price(location,sqft,bath,bhk):
    loc_index=np.where(X.columns==location)[0][0]
    
    x=np.zeros(len(X.columns))
    x[0]=sqft
    x[1]=bath
    x[2]=bhk
    if loc_index >=0:
        x[loc_index]=1
    return lreg.predict([x])[0]

In [99]:
predict_price('Whitefield',5000,3,4)

290.4206694337025

In [100]:
predict_price('other',5000,3,4)

283.65905719618877

In [101]:
predict_price('Whitefield',50000,13,40)

2878.770624687806

In [102]:
import pickle

In [110]:
with open('real estate price predictor.pickle','wb') as f:
    pickle.dump(lreg,f)

In [109]:
import json

In [112]:
columns={
    'data_columns':[col.lower() for col in X.columns]
}
with open("columns.json","w") as f:
    f.write(json.dumps(columns))